Revit 2024 API
RebarHandlePositionData.GetDistributionPath Method
 Gets the distribution path currently stored in the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public IList<Curve> GetDistributionPath()
Visual Basic
Public Function GetDistributionPath As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetDistributionPath()
Return Value
 Returns array of curves that represent the distribution path.
Remarks
 For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars. The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
See Also
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace